<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"53f53c979be385afbe4a605b377591702d01f29cb45619c0bed23d706bcaa755","plan_job_ref":"Job Test actions using target and replace #499 at https://github.com/dflook/terraform-github-actions/actions/runs/15334321268","plan_out_hash":"e193737df897ccdaa61383c6bd40e728b1a02091ce3c235a9e7f5570699211b6","plan_hash":"bd48587f9294b8a5c4a5761e617058e113dca611bcb413a81ca7f466e667e57d","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "MTKhg6GSxR" -> (known after apply)
!~  foreach = "Y5WGBUkEmp" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #499](https://github.com/dflook/terraform-github-actions/actions/runs/15334321268)